In [17]:
import pandas as pd
import numpy as np

In [7]:
s = pd.Series(range(100, 110), dtype=float)

In [11]:
pd.Series({"apple": "A sweet red", "mango": "King of fruits" })

apple       A sweet red
mango    King of fruits
dtype: object

In [14]:
pd.Series(["King of fruits", "A sweet red"], index=["Mango", "Apple"])

Mango    King of fruits
Apple       A sweet red
dtype: object

In [20]:
n = np.random.randint(10, 20, (5, 5))

In [23]:
ind = np.random.randint(50, 100, (5,))

In [28]:
cols = ["A", "B", "C", "D", "E"]

In [29]:
ind, cols

(array([94, 64, 69, 82, 85]), ['A', 'B', 'C', 'D', 'E'])

In [30]:
pd.DataFrame(n, index=ind, columns=cols)

     A   B   C   D   E
94  17  19  12  15  16
64  11  16  10  18  19
69  15  10  12  14  18
82  14  12  16  10  18
85  10  10  12  14  11

In [31]:
names = ["Anuj", "Naman", "Mohit"]
ages = [26, 21, 28]

In [32]:
d = {"names" : names, "ages" : ages}

In [33]:
d

{'names': ['Anuj', 'Naman', 'Mohit'], 'ages': [26, 21, 28]}

In [34]:
pd.DataFrame(d)

   names  ages
0   Anuj    26
1  Naman    21
2  Mohit    28

In [35]:
li = [{"name" : "Anuj", "age" : 26}, {"name" : "Mohit", "age" : 28}]

In [37]:
df = pd.DataFrame(li)

In [54]:
df.to_csv("hello.csv", index=False)

In [67]:
df = pd.read_csv("hello.csv")

In [68]:
df

   age           name
0   26           Anuj
1   28          Mohit
2   25           Ravi
3   21         Garima
4   34   Mohan Gandhi

In [62]:
df.to_html("hello.html")

In [71]:
df.name

0             Anuj
1            Mohit
2             Ravi
3           Garima
4     Mohan Gandhi
Name: name, dtype: object

In [72]:
df["name"]

0             Anuj
1            Mohit
2             Ravi
3           Garima
4     Mohan Gandhi
Name: name, dtype: object

In [74]:
df["place"] = ["Delhi"] * 5

In [75]:
df

   age           name  place
0   26           Anuj  Delhi
1   28          Mohit  Delhi
2   25           Ravi  Delhi
3   21         Garima  Delhi
4   34   Mohan Gandhi  Delhi

In [76]:
df[["name", "place"]]

            name  place
0           Anuj  Delhi
1          Mohit  Delhi
2           Ravi  Delhi
3         Garima  Delhi
4   Mohan Gandhi  Delhi

In [82]:
df.loc[df.age > 26]

   age           name  place
1   28          Mohit  Delhi
4   34   Mohan Gandhi  Delhi

In [83]:
df.age > 26

0    False
1     True
2    False
3    False
4     True
Name: age, dtype: bool

In [84]:
df

   age           name  place
0   26           Anuj  Delhi
1   28          Mohit  Delhi
2   25           Ravi  Delhi
3   21         Garima  Delhi
4   34   Mohan Gandhi  Delhi

In [88]:
a = df.iloc[::-1, 1:]

In [89]:
a

            name  place
4   Mohan Gandhi  Delhi
3         Garima  Delhi
2           Ravi  Delhi
1          Mohit  Delhi
0           Anuj  Delhi

In [107]:
b = df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
age      5 non-null int64
name     5 non-null object
place    5 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [106]:
type(b)

NoneType

In [104]:
df.describe()

             age
count   5.000000
mean   26.800000
std     4.764452
min    21.000000
25%    25.000000
50%    26.000000
75%    28.000000
max    34.000000

In [93]:
type(another)

pandas.core.frame.DataFrame

In [103]:
df.sort_index(axis=1, ascending=False)

   place           name  age
0  Delhi           Anuj   26
1  Delhi          Mohit   28
2  Delhi           Ravi   25
3  Delhi         Garima   21
4  Delhi   Mohan Gandhi   34

In [110]:
df.sort_values("age", ascending=False)

   age           name  place
4   34   Mohan Gandhi  Delhi
1   28          Mohit  Delhi
0   26           Anuj  Delhi
2   25           Ravi  Delhi
3   21         Garima  Delhi

In [114]:
df.sort_values("name")

   age           name  place
4   34   Mohan Gandhi  Delhi
0   26           Anuj  Delhi
3   21         Garima  Delhi
1   28          Mohit  Delhi
2   25           Ravi  Delhi

In [116]:
data = pd.DataFrame(np.random.randint(10, 20, (5, 5)))

In [117]:
data

    0   1   2   3   4
0  19  13  13  14  19
1  18  10  10  19  18
2  10  13  12  11  11
3  12  13  14  11  14
4  18  10  11  18  18

In [118]:
data.sort_values(2, axis=1)

    0   3   4   2   1
0  19  14  19  13  13
1  18  19  18  10  10
2  10  11  11  12  13
3  12  11  14  14  13
4  18  18  18  11  10

In [120]:
data[5] = 1

In [121]:
data

    0   1   2   3   4  5
0  19  13  13  14  19  1
1  18  10  10  19  18  1
2  10  13  12  11  11  1
3  12  13  14  11  14  1
4  18  10  11  18  18  1

In [123]:
data.head(1)

    0   1   2   3   4  5
0  19  13  13  14  19  1

In [126]:
data.tail(3)

    0   1   2   3   4  5
2  10  13  12  11  11  1
3  12  13  14  11  14  1
4  18  10  11  18  18  1

In [127]:
df

   age           name  place
0   26           Anuj  Delhi
1   28          Mohit  Delhi
2   25           Ravi  Delhi
3   21         Garima  Delhi
4   34   Mohan Gandhi  Delhi

In [128]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [129]:
df.columns

Index(['age', 'name', 'place'], dtype='object')

In [131]:
b = df.sort_values("age")

In [137]:
b.values.dtype

dtype('O')

In [136]:
data.values.dtype

dtype('int64')

In [139]:
data.loc[0, 0]

19

In [141]:
data.at[0, 0]

19

In [144]:
df.at[0, "name"]

'Anuj'

In [145]:
df.at[0, "name"] = "Panda"

In [146]:
df

   age           name  place
0   26          Panda  Delhi
1   28          Mohit  Delhi
2   25           Ravi  Delhi
3   21         Garima  Delhi
4   34   Mohan Gandhi  Delhi

In [147]:
df.iloc[:3, -1] = "Noida"

In [176]:
df

   age           name  place
0   27          Panda  Noida
1   29          Mohit  Noida
2   26           Ravi  Noida
3   22         Garima  Delhi
4   35   Mohan Gandhi  Delhi

In [157]:
data

    0   1   2   3   4  5
0  19  13  13  14  19  1
1  18  10  10  19  18  1
2  10  13  12  11  11  1
3  12  13  14  11  14  1
4  18  10  11  18  18  1

In [161]:
df["age"] = df["age"] + 1

In [169]:
df.iloc[0]["age"]

27

In [179]:
def inc(item):
    item["age"] = item["age"] + 1
    return item

In [180]:
df.apply(inc, axis=1)

   age           name  place
0   28          Panda  Noida
1   30          Mohit  Noida
2   27           Ravi  Noida
3   23         Garima  Delhi
4   36   Mohan Gandhi  Delhi

In [182]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                            'foo', 'bar', 'foo', 'foo'],
                       'B': ['one', 'one', 'two', 'three',
                            'two', 'two', 'one', 'three'],
                      'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [183]:
df

     A      B         C         D
0  foo    one -0.466485  0.295090
1  bar    one  1.091514  0.360109
2  foo    two  0.972842  0.034055
3  bar  three -0.977093 -2.408997
4  foo    two -0.836802 -0.438671
5  bar    two  2.632210  0.753396
6  foo    one -0.705436 -0.455122
7  foo  three -1.403174  0.285762

In [193]:
c = df.groupby(["A", "B"]).mean()

In [194]:
c.

C    2.632210
D    0.753396
Name: (bar, two), dtype: float64

In [195]:
c.reset_index()

     A      B         C         D
0  bar    one  1.091514  0.360109
1  bar  three -0.977093 -2.408997
2  bar    two  2.632210  0.753396
3  foo    one -0.585961 -0.080016
4  foo  three -1.403174  0.285762
5  foo    two  0.068020 -0.202308